{
  "metadata": {
    "total_size": 11410599944
  },
  "weight_map": {
    "classification_head.dense.bias": "model-00003-of-00003.safetensors",
    "classification_head.dense.weight": "model-00003-of-00003.safetensors",
    "classification_head.out_proj.bias": "model-00003-of-00003.safetensors",
    "classification_head.out_proj.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.0.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.decoder.block.0.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.0.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.1.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.10.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.11.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.12.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.13.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.14.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.15.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.16.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.17.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.18.layer.2.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.18.layer.2.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.1.EncDecAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.1.EncDecAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.1.EncDecAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.1.EncDecAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.2.DenseReluDense.wi.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.2.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.19.layer.2.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.2.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.2.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.20.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.1.EncDecAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.1.EncDecAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.1.EncDecAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.1.EncDecAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.2.DenseReluDense.wi.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.2.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.20.layer.2.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.1.EncDecAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.1.EncDecAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.1.EncDecAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.1.EncDecAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.2.DenseReluDense.wi.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.2.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.21.layer.2.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.1.EncDecAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.1.EncDecAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.1.EncDecAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.1.EncDecAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.2.DenseReluDense.wi.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.2.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.22.layer.2.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.0.SelfAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.0.SelfAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.0.SelfAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.0.SelfAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.0.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.1.EncDecAttention.k.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.1.EncDecAttention.o.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.1.EncDecAttention.q.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.1.EncDecAttention.v.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.1.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.2.DenseReluDense.wi.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.2.DenseReluDense.wo.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.23.layer.2.layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.decoder.block.3.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.3.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.4.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.5.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.6.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.7.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.8.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.0.SelfAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.0.SelfAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.0.SelfAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.0.SelfAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.0.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.1.EncDecAttention.k.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.1.EncDecAttention.o.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.1.EncDecAttention.q.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.1.EncDecAttention.v.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.1.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.2.DenseReluDense.wi.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.2.DenseReluDense.wo.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.block.9.layer.2.layer_norm.weight": "model-00002-of-00003.safetensors",
    "transformer.decoder.final_layer_norm.weight": "model-00003-of-00003.safetensors",
    "transformer.encoder.block.0.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.0.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.1.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.10.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.11.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.12.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.13.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.14.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.15.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.16.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.17.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.18.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.19.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.2.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.20.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.21.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.22.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.23.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.3.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.4.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.5.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.0.SelfAttention.q.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.0.SelfAttention.v.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.0.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.1.DenseReluDense.wi.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.1.DenseReluDense.wo.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.6.layer.1.layer_norm.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.7.layer.0.SelfAttention.k.weight": "model-00001-of-00003.safetensors",
    "transformer.encoder.block.7.layer.0.SelfAttention.o.weight": "model-00001-of-00003.safetensors",
